# Умови:
# Створи список днів тижня (рядки: "Понеділок", "Вівторок", ...).
# Для кожного дня створи список уроків (кожен урок — це кортеж у форматі (назва_предмета, кількість_годин)).
# Наприклад:
# [("Математика", 2), ("Англійська", 1), ("Фізкультура", 1)]
# Весь розклад має бути списком, де кожен елемент — це кортеж (день, список_уроків).
# Приклад:
# [
#     ("Понеділок", [("Математика", 2), ("Англійська", 1)]),
#     ("Вівторок", [("Фізика", 2), ("Історія", 1), ("Музика", 1)])
# ]
#
# Програма має:
# Вивести розклад у зручному вигляді.
# Порахувати загальну кількість годин на тиждень.
# Знайти найдовший день (де найбільше годин).
# Використати умови:
# якщо загальна кількість годин > 25 → вивести "Розклад дуже завантажений"
# якщо < 15 → "Розклад занадто легкий"
# інакше "Оптимальний розклад".
# Використати різні типи даних:
# рядки (назви предметів, днів),
# числа (години),
# списки (уроки, дні тижня),
# кортежі (день + список уроків),
# булеві значення (наприклад, чи є день довшим за 5 годин).
#
# Приклад очікуваного результату:
# Понеділок: Математика (2 год), Англійська (1 год)
# Вівторок: Фізика (2 год), Історія (1 год), Музика (1 год)
# ...
# Загалом годин: 27
# Найдовший день: Вівторок (4 год)
# Висновок: Розклад дуже завантажений

import json

from utils.handlers.schedule.handlers import SchudleHandler

def main():
    schudleHandler = SchudleHandler()
    sumHours = schudleHandler.calc_all_hours()["allHours"]
    longestDay = schudleHandler.clac_longest_day()

    print("Розклад: " + json.dumps(schudleHandler.get_all_schadle(), indent=4))
    print(f"Загальна кількість годин на тиждень: {sumHours}")
    print(f"Найдовший день: {longestDay}")

    schudleHandler.get_schadle_load()

if __name__ == "__main__":
    main()